loadtest-logs-manualrun/test-result.txt
root@57a8c1f8eb44:/workspace# k6 run loadtest/quote-api-load.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: loadtest/quote-api-load.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 7m30s max duration (incl. graceful stop):
              * default: Up to 20 looping VUs for 7m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS

    http_req_duration{expected_response:true}
    ✓ 'p(95)<400' p(95)=173.04ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.29%


  █ TOTAL RESULTS

    checks_total.......: 50182  119.464791/s
    checks_succeeded...: 99.70% 50032 out of 50182
    checks_failed......: 0.29%  150 out of 50182

    ✗ status is 200
      ↳  99% — ✓ 25016 / ✗ 75
    ✗ has quote field
      ↳  99% — ✓ 25016 / ✗ 75

    HTTP
    http_req_duration..............: avg=150.58ms min=678.74µs med=120.73ms max=30s      p(90)=162.15ms p(95)=173.19ms
      { expected_response:true }...: avg=127.04ms min=101.22ms med=120.76ms max=333.05ms p(90)=162.06ms p(95)=173.04ms
    http_req_failed................: 0.29%  75 out of 25091
    http_reqs......................: 25091  59.732396/s

    EXECUTION
    iteration_duration.............: avg=150.69ms min=756.29µs med=120.84ms max=30s      p(90)=162.27ms p(95)=173.28ms
    iterations.....................: 25091  59.732396/s
    vus............................: 1      min=1           max=20
    vus_max........................: 20     min=20          max=20

    NETWORK
    data_received..................: 5.2 MB 12 kB/s
    data_sent......................: 2.3 MB 5.4 kB/s



running (7m00.1s), 00/20 VUs, 25091 complete and 0 interrupted iterations
default ✓ [======================================] 00/20 VUs  7m0s